import pytest
import allure


QUESTIONS_DATA = [
    (0, "Сколько это стоит? И как оплатить?", "Сутки — 400 рублей. Оплата курьеру — наличными или картой."),
    (1, "Хочу сразу несколько самокатов! Так можно?", "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим."),
    (2, "Как рассчитывается время аренды?", "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30."),
    (3, "Можно ли заказать самокат прямо на сегодня?", "Только начиная с завтрашнего дня. Но скоро станем расторопнее."),
    (4, "Можно ли продлить заказ или вернуть самокат раньше?", "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010."),
    (5, "Вы привозите зарядку вместе с самокатом?", "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится."),
    (6, "Можно ли отменить заказ?", "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои."),
    (7, "Я жизу за МКАДом, привезёте?", "Да, обязательно. Всем самокатов! И Москве, и Московской области."),
]

@allure.feature("Главная страница")
@allure.story("Вопросы о важном")
class TestQuestions:

    @pytest.mark.parametrize("index, question, expected", QUESTIONS_DATA)
    @allure.title("Проверка вопроса: {question}")
    def test_question_opens_and_shows_correct_answer(self, main_page, index, question, expected):
        # Кликаем на вопрос
        main_page.click_question(index)

        #Проверяем, что ответ открылся
        is_open = main_page.is_answer_open(index)
        assert is_open, f"Ответ на вопрос №{index} не открылся!"

        #Проверяем текст ответа на вопрос
        actual_answer = main_page.get_answer_text(index)
        assert actual_answer == expected, (
            f"Текст ответа не совпадает!\n"
            f"Ожидалось: '{expected}'\n"
            f"Получено: '{actual_answer}'"
        )
